START_MESSAGE = 'Спасибо, что решили выбрать именно нас!'
CREDIT_MATCHING_TEXT = """
🔍 Запуск мастера по подбору займов...

Мастер по подбору займов — это автоматизированный процесс, направленный на выявление списка наиболее подходящих(конкретному пользователю) предложений, основываясь на полученных данных.

Что он умеет?
❕ Автоматические фильтры по возрасту, стране
❕ Сортировка по проценту одобрений, рейтингу
❕ Выберет варианты под Вашу кредитную историю

🚫 Удаленные Вами организации: Нет
"""
CREDIT_MATCHING_DESCRIPTION = """
✋ Привет! Меня зовут Ника. 

🤖 Я Бот-помощник для поиска выгодных предложений по займам. Я имею сотни предложений и подберу самое выгодное для тебя. 

Полученные от тебя данные анализируются, основываясь на них, я корректирую выдачу результатов наилучшим образом.

❓ Как пользоваться ботом - быстрый гайд.
❓ Описание каждого модуля бота
❓ Как точно получить займ - статья

✅ Для получения полного списка предложений и наилучшей выдачи результатов необходимо заполнить профиль по кнопке снизу.

------------------------------
️ВНИМАНИЕ! У Вас еще не заполнен профиль — Вам доступны не все предложения.
"""
CREDIT_MATCHING_START_TEXT = """
Вы в любой момент можете отменить ввод, воспользовавшись, кнопкой на клавиатуре.
"""
CREDIT_MATCHING_Q1_TEXT = """
Займ-бот | Быстрый подбор под 0%, [19 авг. 2023 г., 18:08:41]:
Вы в любой момент можете отменить ввод, воспользовавшись, кнопкой на клавиатуре.

# ️️ВОПРОС (1/4) 
❗️Как часто Вы пользуетесь услугами займов?

------------------------------
Сейчас бот реагирует только на кнопки под этим постом.
"""
CREDIT_MATCHING_Q2_TEXT = """
Займ-бот | Быстрый подбор под 0%, [19 авг. 2023 г., 19:01:39]:
Вы в любой момент можете отменить ввод, воспользовавшись, кнопкой на клавиатуре.

# ️️ВОПРОС (2/4)
❗️Как давно Вы брали свой крайний займ?

------------------------------
Сейчас бот реагирует только на кнопки под этим постом.
"""
CREDIT_MATCHING_Q3_TEXT = """
Займ-бот | Быстрый подбор под 0%, [19 авг. 2023 г., 19:21:22]:
Вы в любой момент можете отменить ввод, воспользовавшись, кнопкой на клавиатуре.

# ️️ВОПРОС (3/4) 
❗️Выберите количество Ваших активных займов.

------------------------------
Сейчас бот реагирует только на кнопки под этим постом.
"""
CREDIT_MATCHING_Q4_TEXT = """
Займ-бот | Быстрый подбор под 0%, [19 авг. 2023 г., 19:01:17]:
Вы в любой момент можете отменить ввод, воспользовавшись, кнопкой на клавиатуре.

# ️️ВОПРОС (2/4) 
❗️Выберите какой вариант займа вам интересен. Под 0 % или под обычный процент?

------------------------------
Сейчас бот реагирует только на кнопки под этим постом.
"""
CREDIT_MATCHING_FINISH_TEXT = """
Займ-бот | Быстрый подбор под 0%, [19 авг. 2023 г., 19:25:32]:
Вы в любой момент можете отменить ввод, воспользовавшись, кнопкой на клавиатуре.

♻️ Идёт анализ полученных данных...

🚫 Удаленные Вами организации: Нет

⚠️ Бот ИСКЛЮЧИЛ из выдачи предложения, где:
├ Минимальный возраст больше
├ Нельзя взять займ под 0%
└ Отказывают с плохой кредитной историей

⚠️ Дополнительная сортировка по проценту одобренных заявок.
Предложений, приготовленных для Вас: (7)  - на самых выгодных и наиболее подходящих условиях.

Нажмите на кнопку показать, для продолжения.
"""
CREDIT_MATCHING_SHOW_TEXT = """
Ваши результаты:
"""
ADD_OFFER_PHOTO_TEXT = """
Скиньте фото офера:
"""
ADD_OFFER_DESCRIPTION_TEXT = """
Скиньте описание офера:
"""
ADD_OFFER_URL_TEXT = """
Скиньте описание офера:
"""
ADD_OFFER_RESULT = """
Описание: {}
Ссылка: {}
"""